ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/MCSPI_MCSPI_52200000h.xml
	<bitfield id="SPIEN_3" width="1" begin="3" end="3" resetval="0x0" description="SPIEN[3] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[3] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[3] line [high or low], and a write into this bit has no effect" range="3" rwaccess="R/W"/>
	<bitfield id="SPIEN_2" width="1" begin="2" end="2" resetval="0x0" description="SPIEN[2] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[2] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[2] line [high or low], and a write into this bit has no effect" range="2" rwaccess="R/W"/>
	<bitfield id="SPIEN_1" width="1" begin="1" end="1" resetval="0x0" description="SPIEN[1] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[1] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[1] line [high or low], and a write into this bit has no effect" range="1" rwaccess="R/W"/>
	<bitfield id="SPIEN_0" width="1" begin="0" end="0" resetval="0x0" description="SPIEN[0] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[0] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[0] line [high or low], and a write into this bit has no effect" range="0" rwaccess="R/W"/>
	</register><register id="MCSPI_MODULCTRL" acronym="MCSPI_MODULCTRL" offset="296" width="32" description="This register is dedicated to the configuration of the serial port interface. ">
		<bitfield id="RESERVED_11" width="23" begin="31" end="9" resetval="0x0" description="Reads returns 0" range="31:9" rwaccess="R"/>
	<bitfield id="FDAA" width="1" begin="8" end="8" resetval="0x0" description="FIFO DMA Address 256-bit aligned This register is used when a FIFO is managed by the module and DMA connected to the controller provides only 256 bit aligned address If this bit is set the enabled channel which uses the FIFO has its datas managed through MCSPI_DAFTX and MCSPI_DAFRX registers instead of MCSPI_TX[i] and MCSPI_RX[i] registers 0      FIFO data managed by MCSPI_TX(i) and       MCSPI_RX(i) registers.1      FIFO data managed by MCSPI_DAFTX and       MCSPI_DAFRX registers." range="8" rwaccess="R/W"/>
	<bitfield id="MOA" width="1" begin="7" end="7" resetval="0x0" description="Multiple word ocp access: This register can only be used when a channel is enabled using a FIFO It allows the system to perform multiple SPI word access for a single 32-bit OCP word access This is possible for WL &#60; 16 0      Multiple word access disabled1      Multiple word access enabled with FIFO" range="7" rwaccess="R/W"/>
	<bitfield id="INITDLY" width="3" begin="6" end="4" resetval="0x0" description="Initial spi delay for first transfer: This register is an option only available in SINGLE master mode, The controller waits for a delay to transmit the first spi word after channel enabled and corresponding TX register filled This Delay is based on SPI output frequency clock, No clock output provided to the boundary and chip select is not active in 4 pin mode within this period  0      No delay for first MCSPI transfer.1      The controller wait 4 MCSPI bus clock2      The controller wait 8 MCSPI bus clock3      The controller wait 16 MCSPI bus clock4      The controller wait 32 MCSPI bus clock" range="6:4" rwaccess="R/W"/>
	<bitfield id="SYSTEM_TEST" width="1" begin="3" end="3" resetval="0x0" description="Enables the system test mode 0      Functional mode1      System test mode (SYSTEST)" range="3" rwaccess="R/W"/>
	<bitfield id="MS" width="1" begin="2" end="2" resetval="0x1" description="Master/ Target  0      Controller - The module generates the       SPICLK and SPIEN[3:0].1      Peripheral - The module receives the SPICLK       and SPIEN[3:0]." range="2" rwaccess="R/W"/>
	<bitfield id="PIN34" width="1" begin="1" end="1" resetval="0x0" description="Pin mode selection: This register is used to configure the SPI pin mode, in master or target mode If asserted the controller only use SIMO,SOMI and SPICLK clock pin for spi transfers 0      SPIEN is used as a chip-select.1      SPIEN is not used. In this mode all related       options to chip-select have no meaning." range="1" rwaccess="R/W"/>
	<bitfield id="SINGLE" width="1" begin="0" end="0" resetval="0x0" description="Single channel / Multi Channel [master mode only] 0      More than one channel will be used in       controller mode.1      Only one channel will be used in controller       mode. This bit must be set in Force       SPIEN[i] mode." range="0" rwaccess="R/W"/>
	</register><register id="MCSPI_CH0CONF" acronym="MCSPI_CH0CONF" offset="300" width="32" description="This register is dedicated to the configuration of the channel 0">
		<bitfield id="RESERVED_0" width="2" begin="31" end="30" resetval="0x0" description="Read returns 0" range="31:30" rwaccess="R"/>
	<bitfield id="CLKG" width="1" begin="29" end="29" resetval="0x0" description="Clock divider granularity This register defines the granularity of channel clock divider: power of two or one clock cycle granularity When this bit is set the register MCSPI_CHCTRL[EXTCLK] must be configured to reach a maximum of4096clock divider ratio Then The clock divider ratio is a concatenation of MCSPI_CHCONF[CLKD] and MCSPI_CHCTRL[EXTCLK] values 0      Clock granularity of power of 21      One clock cycle granularity" range="29" rwaccess="R/W"/>
	<bitfield id="FFER" width="1" begin="28" end="28" resetval="0x0" description="FIFO enabled for receive:Only one channel can have this bit field set 0      The buffer is not used to receive data.1      The buffer is used to receive data." range="28" rwaccess="R/W"/>
	<bitfield id="FFEW" width="1" begin="27" end="27" resetval="0x0" description="FIFO enabled for Transmit:Only one channel can have this bit field set 0      The buffer is not used to transmit data.1      The buffer is used to transmit data." range="27" rwaccess="R/W"/>
	<bitfield id="TCS0" width="2" begin="26" end="25" resetval="0x0" description="Chip Select Time Control This 2-bits field defines the number of interface clock cycles between CS toggling and first or last edge of SPI clock 0      0.5 clock cycle1      1.5 clock cycles2      2.5 clock cycles3      3.5 clock cycles" range="26:25" rwaccess="R/W"/>
	<bitfield id="SBPOL" width="1" begin="24" end="24" resetval="0x0" description="Start bit polarity 0      SPICLK is held low during the INACTIVE       state1      SPICLK is held high during the INACTIVE       state" range="24" rwaccess="R/W"/>
	<bitfield id="SBE" width="1" begin="23" end="23" resetval="0x0" description="Start bit enable for SPI transfer 0      Default MCSPI transfer length as specified       by WL bit field1      Start bit D/CX added before MCSPI transfer       polarity is defined by MCSPI_CHCONF_0[24]       SBPOL" range="23" rwaccess="R/W"/>
	<bitfield id="SPIENSLV" width="2" begin="22" end="21" resetval="0x0" description="Channel 0 only and target mode only: SPI target select signal detection Reserved bits for other cases 0      Detection enabled only on SPIEN[0]1      Detection enabled only on SPIEN[1]2      Detection enabled only on SPIEN[2]3      Detection enabled only on SPIEN[3]" range="22:21" rwaccess="R/W"/>
	<bitfield id="FORCE" width="1" begin="20" end="20" resetval="0x0" description="Manual SPIEN assertion to keep SPIEN active between SPI words [single channel master mode only]  0      Writing 0 into this bit drives low the       SPIEN line when MCSPI_CHCONF_0[6] EPOL=0,       and drives it high when MCSPI_CHCONF_0[6]       EPOL=1.1      Writing 1 into this bit drives high the       SPIEN line when MCSPI_CHCONF_0[6] EPOL=0,       and drives it low when MCSPI_CHCONF_0[6]       EPOL=1." range="20" rwaccess="R/W"/>
	<bitfield id="TURBO" width="1" begin="19" end="19" resetval="0x0" description="Turbo mode 0      Turbo is deactivated (recommended for       single MCSPI word transfer).1      Turbo is activated to maximize the       throughput for multiple MCSPI words       transfer." range="19" rwaccess="R/W"/>
	<bitfield id="IS" width="1" begin="18" end="18" resetval="0x1" description="Input Select 0      Data line 0 (SPIDAT[0]) selected for       reception1      Data line 1 (SPIDAT[1]) selected for       reception" range="18" rwaccess="R/W"/>
	<bitfield id="DPE1" width="1" begin="17" end="17" resetval="0x1" description="Transmission Enable for data line 1 [SPIDATAGZEN[1]]  0      Data line 1 (SPIDAT[1]) selected for       transmission1      No transmission on Data Line1 (SPIDAT[1])" range="17" rwaccess="R/W"/>
	<bitfield id="DPE0" width="1" begin="16" end="16" resetval="0x0" description="Transmission Enable for data line 0 [SPIDATAGZEN[0]]  0      Data Line0 (SPIDAT[0]) selected for       transmission1      No transmission on data line 0 (SPIDAT[0])" range="16" rwaccess="R/W"/>
	<bitfield id="DMAR" width="1" begin="15" end="15" resetval="0x0" description="DMA Read request The DMA Read request line is asserted when the channel is enabled and a new data is available in the receive register of the channel The DMA Read request line is deasserted on read completion of the receive register of the channel 0      DMA read request disabled1      DMA read request enabled" range="15" rwaccess="R/W"/>
	<bitfield id="DMAW" width="1" begin="14" end="14" resetval="0x0" description="DMA Write request The DMA Write request line is asserted when The channel is enabled and the transmitter register of the channel is empty The DMA Write request line is deasserted on load completion of the transmitter register of the channel 0      DMA write request disabled1      DMA write request enabled" range="14" rwaccess="R/W"/>
	<bitfield id="TRM" width="2" begin="13" end="12" resetval="0x0" description="Transmit/Receive modes 0      Transmit-and-receive mode1      Receive-only mode2      Transmit-only mode3      Reserved" range="13:12" rwaccess="R/W"/>
	<bitfield id="WL" width="5" begin="11" end="7" resetval="0x0" description="SPI word length 0x0: 	Reserved 0x1: 	Reserved 0x2: 	Reserved 0x3: 	The SPI word is 4-bits long 0x4: 	The SPI word is 5-bits long 0x5: 	The SPI word is 6-bits long 0x6: 	The SPI word is 7-bits long 0x7: 	The SPI word is 8-bits long 0x8: 	The SPI word is 9-bits long 0x9: 	The SPI word is 10-bits long 0xA: 	The SPI word is 11-bits long 0xB: 	The SPI word is 12-bits long 0xC: 	The SPI word is 13-bits long 0xD: 	The SPI word is 14-bits long 0xE: 	The SPI word is 15-bits long 0xF: 	The SPI word is 16-bits long 0x10: 	The SPI word is 17-bits long 0x11: 	The SPI word is 18-bits long 0x12: 	The SPI word is 19-bits long 0x13: 	The SPI word is 20-bits long 0x14: 	The SPI word is 21-bits long 0x15: 	The SPI word is 22-bits long 0x16: 	The SPI word is 23-bits long 0x17: 	The SPI word is 24-bits long 0x18: 	The SPI word is 25-bits long 0x19: 	The SPI word is 26-bits long 0x1A: 	The SPI word is 27-bits long 0x1B: 	The SPI word is 28-bits long 0x1C: 	The SPI word is 29-bits long 0x1D: 	The SPI word is 30-bits long 0x1E: 	The SPI word is 31-bits long 0x1F: 	The SPI word is 32-bits long  0      Reserved1      Reserved2      Reserved3      The MCSPI word is 4 bits long4      The MCSPI word is 5 bits long5      The MCSPI word is 6 bits long6      The MCSPI word is 7 bits long7      The MCSPI word is 8 bits long8      The MCSPI word is 9 bits long9      The MCSPI word is 10 bits longA      The MCSPI word is 11 bits longB      The MCSPI word is 12 bits longC      The MCSPI word is 13 bits longD      The MCSPI word is 14 bits longE      The MCSPI word is 15 bits longF      The MCSPI word is 16 bits long10     The MCSPI word is 17 bits long11     The MCSPI word is 18 bits long12     The MCSPI word is 19 bits long13     The MCSPI word is 20 bits long14     The MCSPI word is 21 bits long15     The MCSPI word is 22 bits long16     The MCSPI word is 23 bits long17     The MCSPI word is 24 bits long18     The MCSPI word is 25 bits long19     The MCSPI word is 26 bits long1A     The MCSPI word is 27 bits long1B     The MCSPI word is 28 bits long1C     The MCSPI word is 29 bits long1D     The MCSPI word is 30 bits long1E     The MCSPI word is 31 bits long1F     The MCSPI word is 32 bits long" range="11:7" rwaccess="R/W"/>
	<bitfield id="EPOL" width="1" begin="6" end="6" resetval="0x0" description="SPIEN polarity 0      SPICLK is held low during the INACTIVE       state1      SPICLK is held high during the INACTIVE       state" range="6" rwaccess="R/W"/>
	<bitfield id="CLKD" width="4" begin="5" end="2" resetval="0x0" description="Frequency divider for SPICLK [only when the module is a Master SPI device] A programmable clock divider divides the SPI reference clock [CLKSPIREF] with a 4-bit value, and results in a new clock SPICLK available to shift-in and shift-out data By default the clock divider ratio has a power of two granularity when MCSPI_CHCONF[CLKG] is cleared, Otherwise this register is the 4 LSB bit of a 12-bit register concatenated with clock divider extension MCSPI_CHCTRL[EXTCLK] registerThe value description below defines the clock ratio when MCSPI_CHCONF[CLKG] is set to 0. 0x0: 	1 0x1: 	2 0x2: 	4 0x3: 	8 0x4: 	16 0x5: 	32 0x6: 	64 0x7: 	128 0x8: 	256 0x9: 	512 0xA: 10240xB: 20480xC: 40960xD: 81920xE: 	163840xF: 	32768 0      11      22      43      84      165      326      647      1288      2569      512A      1024B      2048C      4096D      8192E      16384F      32768" range="5:2" rwaccess="R/W"/>
	<bitfield id="POL" width="1" begin="1" end="1" resetval="0x0" description="SPICLK polarity 0      SPICLK is held low during the INACTIVE       state1      SPICLK is held high during the INACTIVE       state" range="1" rwaccess="R/W"/>
	<bitfield id="PHA" width="1" begin="0" end="0" resetval="0x0" description="SPICLK phase 0      Data are latched on odd-numbered edges of       SPICLK.1      Data are latched on even-numbered edges of       SPICLK." range="0" rwaccess="R/W"/>
	</register><register id="MCSPI_CH0STAT" acronym="MCSPI_CH0STAT" offset="304" width="32" description="This register provides status information about transmitter and receiver registers of channel 0">
		<bitfield id="RESERVED_2" width="25" begin="31" end="7" resetval="0x0" description="Read returns 0" range="31:7" rwaccess="R"/>
	<bitfield id="RXFFF" width="1" begin="6" end="6" resetval="0x0" description="Channel 0 FIFO Receive Buffer Full Status 0      FIFO receive buffer is not full1      FIFO receive buffer is full" range="6" rwaccess="R"/>
	<bitfield id="RXFFE" width="1" begin="5" end="5" resetval="0x0" description="Channel 0 FIFO Receive Buffer Empty Status 0      FIFO receive buffer is not empty1      FIFO receive buffer is empty" range="5" rwaccess="R"/>
	<bitfield id="TXFFF" width="1" begin="4" end="4" resetval="0x0" description="Channel 0 FIFO Transmit Buffer Full Status 0      FIFO transmit buffer is not full1      FIFO transmit buffer is full" range="4" rwaccess="R"/>
	<bitfield id="TXFFE" width="1" begin="3" end="3" resetval="0x0" description="Channel 0 FIFO Transmit Buffer Empty Status 0      FIFO transmit buffer is not empty1      FIFO transmit buffer is empty" range="3" rwaccess="R"/>
	<bitfield id="EOT" width="1" begin="2" end="2" resetval="0x0" description="Channel 0 End of transfer Status The definitions of beginning and end of transfer vary with master versus target and the transfer format [Transmit/Receive modes, Turbo mode] See dedicated chapters for details 0      This flag is automatically cleared when the       shift register is loaded with the data from       the transmitter register (beginning of       transfer).1      This flag is automatically set to one at       the end of an MCSPI transfer." range="2" rwaccess="R"/>
	<bitfield id="TXS" width="1" begin="1" end="1" resetval="0x0" description="Channel 0 Transmitter Register Status 0      Register is full.1      Register is empty." range="1" rwaccess="R"/>
	<bitfield id="RXS" width="1" begin="0" end="0" resetval="0x0" description="Channel 0 Receiver Register Status 0      Register is empty.1      Register is full." range="0" rwaccess="R"/>
	</register><register id="MCSPI_CH0CTRL" acronym="MCSPI_CH0CTRL" offset="308" width="32" description="This register is dedicated to enable the channel 0">
		<bitfield id="RESERVED_2" width="16" begin="31" end="16" resetval="0x0" description="Read returns 0" range="31:16" rwaccess="R"/>
	<bitfield id="EXTCLK" width="8" begin="15" end="8" resetval="0x0" description="Clock ratio extension: This register is used to concatenate with MCSPI_CHCONF[CLKD] register for clock ratio only when granularity is one clock cycle [MCSPI_CHCONF[CLKG] set to 1] Then the max value reached is4096clock divider ratio. 0x0:	Clock ratio is CLKD + 1 0x1:	Clock ratio is CLKD + 1 + 16 0xFF:	Clock ratio is CLKD + 1 + 4080 0      Clock ratio is CLKD + 1.1      Clock ratio is CLKD + 1 + 16.FF     Clock ratio is CLKD + 1 + 4080." range="15:8" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="7" begin="7" end="1" resetval="0x0" description="Read returns 0" range="7:1" rwaccess="R"/>
	<bitfield id="EN" width="1" begin="0" end="0" resetval="0x0" description="Channel Enable 0      Channel i is not active.1      Channel i is active." range="0" rwaccess="R/W"/>
	</register><register id="MCSPI_TX0" acronym="MCSPI_TX0" offset="312" width="32" description="This register contains a single SPI word to transmit on the serial link,  what ever SPI word length is. ">
		<bitfield id="TDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 0 Data to transmit" range="31:0" rwaccess="R/W"/>
	</register><register id="MCSPI_RX0" acronym="MCSPI_RX0" offset="316" width="32" description="This register contains a single SPI word received through the serial link, what ever SPI word length is. ">
		<bitfield id="RDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 0 Received Data" range="31:0" rwaccess="R"/>
	</register><register id="MCSPI_CH1CONF" acronym="MCSPI_CH1CONF" offset="320" width="32" description="This register is dedicated to the configuration of the channel 1">
		<bitfield id="RESERVED_0" width="2" begin="31" end="30" resetval="0x0" description="Read returns 0" range="31:30" rwaccess="R"/>
	<bitfield id="CLKG" width="1" begin="29" end="29" resetval="0x0" description="Clock divider granularity This register defines the granularity of channel clock divider: power of two or one clock cycle granularity When this bit is set the register MCSPI_CHCTRL[EXTCLK] must be configured to reach a maximum of4096clock divider ratio Then The clock divider ratio is a concatenation of MCSPI_CHCONF[CLKD] and MCSPI_CHCTRL[EXTCLK] values 0      Clock granularity of power of 21      One clock cycle granularity" range="29" rwaccess="R/W"/>
	<bitfield id="FFER" width="1" begin="28" end="28" resetval="0x0" description="FIFO enabled for receive:Only one channel can have this bit field set 0      The buffer is not used to receive data.1      The buffer is used to receive data." range="28" rwaccess="R/W"/>
	<bitfield id="FFEW" width="1" begin="27" end="27" resetval="0x0" description="FIFO enabled for Transmit:Only one channel can have this bit field set 0      The buffer is not used to transmit data.1      The buffer is used to transmit data." range="27" rwaccess="R/W"/>
	<bitfield id="TCS1" width="2" begin="26" end="25" resetval="0x0" description="Chip Select Time Control This 2-bits field defines the number of interface clock cycles between CS toggling and first or last edge of SPI clock 0      0.5 clock cycle1      1.5 clock cycles2      2.5 clock cycles3      3.5 clock cycles" range="26:25" rwaccess="R/W"/>
	<bitfield id="SBPOL" width="1" begin="24" end="24" resetval="0x0" description="Start bit polarity 0      SPICLK is held low during the INACTIVE       state1      SPICLK is held high during the INACTIVE       state" range="24" rwaccess="R/W"/>
	<bitfield id="SBE" width="1" begin="23" end="23" resetval="0x0" description="Start bit enable for SPI transfer 0      Default MCSPI transfer length as specified       by WL bit field1      Start bit D/CX added before MCSPI transfer       polarity is defined by MCSPI_CHCONF_0[24]       SBPOL" range="23" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="2" begin="22" end="21" resetval="0x0" description="Read returns 0" range="22:21" rwaccess="R"/>
	<bitfield id="FORCE" width="1" begin="20" end="20" resetval="0x0" description="Manual SPIEN assertion to keep SPIEN active between SPI words [single channel master mode only]  0      Writing 0 into this bit drives low the       SPIEN line when MCSPI_CHCONF_1[6] EPOL=0,       and drives it high when MCSPI_CHCONF_1[6]       EPOL=1.1      Writing 1 into this bit drives high the       SPIEN line when MCSPI_CHCONF_1[6] EPOL=0,       and drives it low when MCSPI_CHCONF_1[6]       EPOL=1." range="20" rwaccess="R/W"/>
	<bitfield id="TURBO" width="1" begin="19" end="19" resetval="0x0" description="Turbo mode 0      Turbo is deactivated (recommended for       single MCSPI word transfer).1      Turbo is activated to maximize the       throughput for multiple MCSPI words       transfer." range="19" rwaccess="R/W"/>
	<bitfield id="IS" width="1" begin="18" end="18" resetval="0x1" description="Input Select 0      Data line 0 (SPIDAT[0]) selected for       reception1      Data line 1 (SPIDAT[1]) selected for       reception" range="18" rwaccess="R/W"/>
	<bitfield id="DPE1" width="1" begin="17" end="17" resetval="0x1" description="Transmission Enable for data line 1 [SPIDATAGZEN[1]]  0      Data line 1 (SPIDAT[1]) selected for       transmission1      No transmission on Data Line1 (SPIDAT[1])" range="17" rwaccess="R/W"/>
	<bitfield id="DPE0" width="1" begin="16" end="16" resetval="0x0" description="Transmission Enable for data line 0 [SPIDATAGZEN[0]]  0      Data Line0 (SPIDAT[0]) selected for       transmission1      No transmission on data line 0 (SPIDAT[0])" range="16" rwaccess="R/W"/>
	<bitfield id="DMAR" width="1" begin="15" end="15" resetval="0x0" description="DMA Read request The DMA Read request line is asserted when the channel is enabled and a new data is available in the receive register of the channel The DMA Read request line is deasserted on read completion of the receive register of the channel 0      DMA read request disabled1      DMA read request enabled" range="15" rwaccess="R/W"/>
	<bitfield id="DMAW" width="1" begin="14" end="14" resetval="0x0" description="DMA Write request The DMA Write request line is asserted when The channel is enabled and the transmitter register of the channel is empty The DMA Write request line is deasserted on load completion of the transmitter register of the channel 0      DMA write request disabled1      DMA write request enabled" range="14" rwaccess="R/W"/>
	<bitfield id="TRM" width="2" begin="13" end="12" resetval="0x0" description="Transmit/Receive modes 0      Transmit-and-receive mode1      Receive-only mode2      Transmit-only mode3      Reserved" range="13:12" rwaccess="R/W"/>
