ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/MCSPI_MCSPI_52200000h.xml
	<bitfield id="WL" width="5" begin="11" end="7" resetval="0x0" description="SPI word length 0      Reserved1      Reserved2      Reserved3      The MCSPI word is 4 bits long4      The MCSPI word is 5 bits long5      The MCSPI word is 6 bits long6      The MCSPI word is 7 bits long7      The MCSPI word is 8 bits long8      The MCSPI word is 9 bits long9      The MCSPI word is 10 bits longA      The MCSPI word is 11 bits longB      The MCSPI word is 12 bits longC      The MCSPI word is 13 bits longD      The MCSPI word is 14 bits longE      The MCSPI word is 15 bits longF      The MCSPI word is 16 bits long10     The MCSPI word is 17 bits long11     The MCSPI word is 18 bits long12     The MCSPI word is 19 bits long13     The MCSPI word is 20 bits long14     The MCSPI word is 21 bits long15     The MCSPI word is 22 bits long16     The MCSPI word is 23 bits long17     The MCSPI word is 24 bits long18     The MCSPI word is 25 bits long19     The MCSPI word is 26 bits long1A     The MCSPI word is 27 bits long1B     The MCSPI word is 28 bits long1C     The MCSPI word is 29 bits long1D     The MCSPI word is 30 bits long1E     The MCSPI word is 31 bits long1F     The MCSPI word is 32 bits long" range="11:7" rwaccess="R/W"/>
	<bitfield id="EPOL" width="1" begin="6" end="6" resetval="0x0" description="SPIEN polarity 0      SPICLK is held low during the INACTIVE       state1      SPICLK is held high during the INACTIVE       state" range="6" rwaccess="R/W"/>
	<bitfield id="CLKD" width="4" begin="5" end="2" resetval="0x0" description="Frequency divider for SPICLK [only when the module is a Master SPI device] A programmable clock divider divides the SPI reference clock [CLKSPIREF] with a 4-bit value, and results in a new clock SPICLK available to shift-in and shift-out data By default the clock divider ratio has a power of two granularity when MCSPI_CHCONF[CLKG] is cleared, Otherwise this register is the 4 LSB bit of a 12-bit register concatenated with clock divider extension MCSPI_CHCTRL[EXTCLK] registerThe value description below defines the clock ratio when MCSPI_CHCONF[CLKG] is set to 0 0      11      22      43      84      165      326      647      1288      2569      512A      1024B      2048C      4096D      8192E      16384F      32768" range="5:2" rwaccess="R/W"/>
	<bitfield id="POL" width="1" begin="1" end="1" resetval="0x0" description="SPICLK polarity 0      SPICLK is held low during the INACTIVE       state1      SPICLK is held high during the INACTIVE       state" range="1" rwaccess="R/W"/>
	<bitfield id="PHA" width="1" begin="0" end="0" resetval="0x0" description="SPICLK phase 0      Data are latched on odd-numbered edges of       SPICLK.1      Data are latched on even-numbered edges of       SPICLK." range="0" rwaccess="R/W"/>
	</register><register id="MCSPI_CH3STAT" acronym="MCSPI_CH3STAT" offset="364" width="32" description="This register provides status information about transmitter and receiver registers of channel 3">
		<bitfield id="RESERVED_2" width="25" begin="31" end="7" resetval="0x0" description="Read returns 0" range="31:7" rwaccess="R"/>
	<bitfield id="RXFFF" width="1" begin="6" end="6" resetval="0x0" description="Channel 3 FIFO Receive Buffer Full Status 0      FIFO receive buffer is not full1      FIFO receive buffer is full" range="6" rwaccess="R"/>
	<bitfield id="RXFFE" width="1" begin="5" end="5" resetval="0x0" description="Channel 3 FIFO Receive Buffer Empty Status 0      FIFO receive buffer is not empty1      FIFO receive buffer is empty" range="5" rwaccess="R"/>
	<bitfield id="TXFFF" width="1" begin="4" end="4" resetval="0x0" description="Channel 3 FIFO Transmit Buffer Full Status 0      FIFO transmit buffer is not full1      FIFO transmit buffer is full" range="4" rwaccess="R"/>
	<bitfield id="TXFFE" width="1" begin="3" end="3" resetval="0x0" description="Channel 3 FIFO Transmit Buffer Empty Status 0      FIFO transmit buffer is not empty1      FIFO transmit buffer is empty" range="3" rwaccess="R"/>
	<bitfield id="EOT" width="1" begin="2" end="2" resetval="0x0" description="Channel 3 End of transfer Status The definitions of beginning and end of transfer vary with master versus target and the transfer format [Transmit/Receive modes, Turbo mode] See dedicated chapters for details 0      This flag is automatically cleared when the       shift register is loaded with the data from       the transmitter register (beginning of       transfer).1      This flag is automatically set to one at       the end of an MCSPI transfer." range="2" rwaccess="R"/>
	<bitfield id="TXS" width="1" begin="1" end="1" resetval="0x0" description="Channel 3 Transmitter Register Status 0      Register is full.1      Register is empty." range="1" rwaccess="R"/>
	<bitfield id="RXS" width="1" begin="0" end="0" resetval="0x0" description="Channel 3 Receiver Register Status 0      Register is empty.1      Register is full." range="0" rwaccess="R"/>
	</register><register id="MCSPI_CH3CTRL" acronym="MCSPI_CH3CTRL" offset="368" width="32" description="This register is dedicated to enable the channel 3">
		<bitfield id="RESERVED_2" width="16" begin="31" end="16" resetval="0x0" description="Read returns 0" range="31:16" rwaccess="R"/>
	<bitfield id="EXTCLK" width="8" begin="15" end="8" resetval="0x0" description="Clock ratio extension: This register is used to concatenate with MCSPI_CHCONF[CLKD] register for clock ratio only when granularity is one clock cycle [MCSPI_CHCONF[CLKG] set to 1] Then the max value reached is4096clock divider ratio 0      Clock ratio is CLKD + 1.1      Clock ratio is CLKD + 1 + 16.FF     Clock ratio is CLKD + 1 + 4080." range="15:8" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="7" begin="7" end="1" resetval="0x0" description="Read returns 0" range="7:1" rwaccess="R"/>
	<bitfield id="EN" width="1" begin="0" end="0" resetval="0x0" description="Channel Enable 0      Channel i is not active.1      Channel i is active." range="0" rwaccess="R/W"/>
	</register><register id="MCSPI_TX3" acronym="MCSPI_TX3" offset="372" width="32" description="This register contains a single SPI word to transmit on the serial link,  what ever SPI word length is. ">
		<bitfield id="TDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 3 Data to transmit" range="31:0" rwaccess="R/W"/>
	</register><register id="MCSPI_RX3" acronym="MCSPI_RX3" offset="376" width="32" description="This register contains a single SPI word received through the serial link, what ever SPI word length is. ">
		<bitfield id="RDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 3 Received Data" range="31:0" rwaccess="R"/>
	</register><register id="MCSPI_XFERLEVEL" acronym="MCSPI_XFERLEVEL" offset="380" width="32" description="This register provides transfer levels needed while using FIFO buffer during transfer.">
		<bitfield id="WCNT" width="16" begin="31" end="16" resetval="0x0" description="Spi word counterThis register holds the programmable value of number of SPI word to be transferred on channel which is using the FIFO bufferWhen transfer had started, a read back in this register returns the current SPI word transfer index. 0x0:	Counter not used 0x1:	One spi word .. 0xFFFE:	65534 spi word 0xFFFF:	65535 spi word 0      Counter not used1      One wordFFFE   65534 MCSPI wordFFFF   65535 MCSPI word" range="31:16" rwaccess="R/W"/>
	<bitfield id="AFL" width="8" begin="15" end="8" resetval="0x0" description="Buffer Almost Full This register holds the programmable almost full level value used to determine almost full buffer condition If the user wants an interrupt or a DMA read request to be issued during a receive operation when the data buffer holds at least n bytes, then the buffer MCSPI_MODULCTRL[AFL] must be set with n-1The size of this register is defined by the generic parameter FFNBYTE. 0x0:	One byte 0x1:	2 bytes . . 0xFF:	256 bytes 0      1 byte1      2 bytesFE     255bytesFF     256bytes" range="15:8" rwaccess="R/W"/>
	<bitfield id="AEL" width="8" begin="7" end="0" resetval="0x0" description="Buffer Almost EmptyThis register holds the programmable almost empty level value used to determine almost empty buffer condition If the user wants an interrupt or a DMA write request to be issued during a transmit operation when the data buffer is able to receive n bytes, then the buffer MCSPI_MODULCTRL[AEL] must be set with n-1. 0x0:	One byte 0x1:	2 bytes . . 0xFF:	256 bytes 0      1 byte1      2 bytesFE     255 bytesFF     256bytes" range="7:0" rwaccess="R/W"/>
	</register><register id="MCSPI_DAFTX" acronym="MCSPI_DAFTX" offset="384" width="32" description="This register contains the  SPI words to transmit on the serial link when FIFO used and DMA address is aligned on 256 bit.This register is an image of one of MCSPI_TX(i) register corresponding to the channel which have its FIFO enabled.">
		<bitfield id="DAFTDATA" width="32" begin="31" end="0" resetval="0x0" description="FIFO Data to transmit with DMA 256 bit aligned address This Register is only is used when MCSPI_MODULCTRL[FDAA] is set to '1' and only one of the MCSPI_CH[i]CONF[FFEW] of enabled channels is set If these conditions are not respected any access to this register return a null value" range="31:0" rwaccess="R/W"/>
	</register><register id="MCSPI_DAFRX" acronym="MCSPI_DAFRX" offset="416" width="32" description="This register contains the  SPI words to received on the serial link when FIFO used and DMA address is aligned on 256 bit.This register is an image of one of MCSPI_RX(i) register corresponding to the channel which have its FIFO enabled.">
		<bitfield id="DAFRDATA" width="32" begin="31" end="0" resetval="0x0" description="FIFO Data to transmit with DMA 256 bit aligned address This Register is only is used when MCSPI_MODULCTRL[FDAA] is set to '1' and only one of the MCSPI_CH[i]CONF[FFEW] of enabled channels is set If these conditions are not respected any access to this register return a null value" range="31:0" rwaccess="R"/>
	</register>
</module>